// 2. Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на само себя).
//     4 -> 16 
//     -3 -> 9 
//     -7 -> 49

Console.WriteLine("Введите число ");
int N = int.Parse(Console.ReadLine());
int result;
result = N * N;
Console.WriteLine (result);