// 1. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
//     456 -> 5
//     782 -> 8
//     918 -> 1

// 14 / 5 = 2.8
// Console.WriteLine (14.0/5.0);
// Console.WriteLine (14.0/5);
// Console.WriteLine (14/5.0);
// // 14 div 5 = 2
// Console.WriteLine (14/5);
// // 14 mod 5 = 4
// Console.WriteLine (14%5);

